# =========================================================
# ОСНОВНОЕ
# =========================================================

BOT_TOKEN = "8853457435:AAGu5AOCad5ERBAMiYbObtHE0PqM0lY7Uzw"
ADMIN_ID = 8141857093

DATABASE = "exchange.db"


# =========================================================
# КУРСЫ
# =========================================================

# Как часто обновлять курс с CoinGecko
RATE_CACHE_SECONDS = 30


# =========================================================
# НАЧАЛЬНЫЕ НАСТРОЙКИ ОБМЕННИКА
# =========================================================

# Наценка при покупке клиентом
TON_BUY_MARKUP = 5.0
USDT_BUY_MARKUP = 3.0

# Скидка при продаже клиентом
TON_SELL_DISCOUNT = 3.0
USDT_SELL_DISCOUNT = 2.0


# =========================================================
# МИНИМАЛЬНЫЕ СУММЫ
# =========================================================

MIN_TON_BUY = 0.1
MIN_USDT_BUY = 10.0

MIN_TON_SELL = 0.1
MIN_USDT_SELL = 10.0


# =========================================================
# КОШЕЛЬКИ
# =========================================================

# TON для получения крипты от клиентов
TON_RECEIVE_WALLET = "UQApyhLTdCECwZzAe8_NbDLEFMKDFhCL13k6p-TiXPXC9f2"

# USDT в сети TON
USDT_RECEIVE_WALLET = "UQApyhLTdCECwZzAe8_NbDLEFMKDFhCL13k6p-TiXPXC9f2"


# =========================================================
# РЕКВИЗИТЫ ДЛЯ ОПЛАТЫ
# =========================================================

PAYMENT_DETAILS = """
🏦 <b>РЕКВИЗИТЫ ДЛЯ ОПЛАТЫ</b>

Банк: СБЕР
Номер: 2202209226426665
Получатель: Артем

⚠️ После оплаты обязательно отправьте чек.
"""


# =========================================================
# ПОДДЕРЖКА
# =========================================================

SUPPORT_USERNAME = "@xocsss"